# RectangleLightShape Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RectangleLightShape Members
RectangleLightShape Class Constructors Methods Properties See Also
---
The RectangleLightShape type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RectangleLightShape()()()() | Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width. |
| RectangleLightShape(RectangleLightShape) | Creates a copy of the given rectangle light shape |
| RectangleLightShape(Double, Double) | Creates a rectangle light shape object with the given emit length and width. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the LightShape derived object.  (Inherited from LightShape.) |
| Dispose | (Inherited from LightShape.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EmitLength | The emit length. |
| EmitWidth | The emit width. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from LightShape.) |

# See Also
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace